{
    "Black Footed Albatross": "The Black-footed Albatross displays a dark plumage, white eye ring, and distinctive black feet, accentuating its captivating appearance as it soars with a wingspan of up to 7 feet across oceanic horizons.",
    "Laysan Albatross": "The Laysan Albatross features a white body with black wingtips, exuding elegance as it graces the skies with its impressive wingspan.",
    "Sooty Albatross": "The Sooty Albatross is characterized by a dark brown plumage and a pale yellow nape, creating a distinctive contrast in its appearance.",
    "Groove Billed Ani": "The Groove-billed Ani showcases sleek black plumage, a distinctive curved bill, and a striking yellow eye ring, defining its unique and captivating look.",
    "Crested Auklet": "The Crested Auklet stands out with its signature bushy crest, striking orange bill, and delicate white plumes on its head, adding to its charming and distinctive appearance.",
    "Least Auklet": "The Least Auklet is recognized by its petite size, dark plumage, and striking white eye, presenting a distinctive and endearing presence.",
    "Parakeet Auklet": "The Parakeet Auklet features a vibrant combination of greenish plumage, a distinctive parrot-like bill, and white underparts, showcasing a unique and captivating appearance.",
    "Rhinoceros Auklet": "The Rhinoceros Auklet is characterized by its distinctive horn-like bill projection, black plumage, and white markings, contributing to its remarkable and recognizable appearance.",
    "Brewer Blackbird": "The Brewer's Blackbird displays glossy black plumage with subtle iridescence, complemented by yellow eyes, adding to its sleek and eye-catching appearance.",
    "Red Winged Blackbird": "The Red-winged Blackbird is noted for its jet-black body, vibrant red shoulder patches, and conical bill, contributing to its distinctive and visually striking look.",
    "Rusty Blackbird": "The Rusty Blackbird showcases a unique blend of glossy black plumage with rusty edges, along with yellow eyes, creating a distinctive and captivating appearance.",
    "Yellow Headed Blackbird": "The Yellow-headed Blackbird features striking black plumage and a bright yellow head and breast, setting it apart with its bold and contrasting appearance.",
    "Bobolink": "The Bobolink exhibits a striking appearance with its black underparts and white upperparts, accompanied by a distinctive buff nape, contributing to its unique and recognizable look.",
    "Indigo Bunting": "The Indigo Bunting is characterized by its brilliant all-blue plumage, creating a visually stunning and unmistakable appearance.",
    "Lazuli Bunting": "The Lazuli Bunting displays a captivating blend of deep blue plumage on its head and back, transitioning to rich chestnut on its breast, presenting a unique and eye-catching appearance.",
    "Painted Bunting": "The Painted Bunting dazzles with a vibrant medley of colors, featuring bright blue head, green back, and red underparts, contributing to its exceptionally colorful and remarkable appearance.",
    "Cardinal": "The Cardinal is known for its striking crimson plumage and distinctive crest, creating a visually captivating and easily recognizable appearance.",
    "Spotted Catbird": "The Spotted Catbird boasts a unique blend of dark gray plumage, distinctive spotted pattern, and a slightly curved bill, contributing to its intriguing and distinctive appearance.",
    "Gray Catbird": "The Gray Catbird features a slate-gray plumage, a black cap atop its head, and a distinctive black patch beneath its tail, enhancing its recognizable and subtly detailed appearance.",
    "Yellow Breasted Chat": "The Yellow-breasted Chat displays a striking combination of olive-green plumage, vibrant yellow throat and breast, and distinctive white eye rings, adding to its unique and captivating appearance.",
    "Eastern Towhee": "The Eastern Towhee is recognized by its black upperparts, rusty sides, white belly, and distinctive red eyes, contributing to its contrasting and easily identifiable appearance.",
    "Chuck Will Widow": "The Chuck-will's-widow showcases mottled brown and gray plumage, large mouth, and white throat patch, creating a distinct and cryptic appearance.",
    "Brandt Cormorant": "The Brandt's Cormorant features a predominantly black body, slender hooked bill, and striking turquoise eye patch, contributing to its distinctive and charismatic appearance.",
    "Red Faced Cormorant": "The Red-faced Cormorant stands out with its glossy black plumage, bright red face patch, and distinctive white plumes on its flanks, creating a unique and captivating appearance",
    "Pelagic Cormorant": "The Pelagic Cormorant is noted for its compact size, dark iridescent plumage, and distinctive white flank patches, contributing to its sleek and charismatic appearance.",
    "Bronzed Cowbird": "The Bronzed Cowbird features glossy black plumage with a distinct purple sheen, yellow eyes, and a slender bill, adding to its distinctive and eye-catching appearance.",
    "Shiny Cowbird": "The Shiny Cowbird showcases glossy black plumage, a slender bill, and striking red eyes, contributing to its distinctive and charismatic appearance.",
    "Brown Creeper": "The Brown Creeper is recognized for its mottled brown upperparts, curved slender bill, and distinctive habit of creeping up tree trunks, contributing to its subtly detailed and specialized appearance.",
    "American Crow": "The American Crow is distinguished by its all-black plumage, strong bill, and distinctive size, presenting a common yet unmistakable appearance.",
    "Fish Crow": "The Fish Crow is similar to the American Crow with its all-black plumage, but slightly smaller size and hoarser calls, contributing to its subtly differentiated appearance.",
    "Black Billed Cuckoo": "The Black-billed Cuckoo is characterized by its slim body, brownish upperparts, white underparts, and distinctive black bill, contributing to its understated yet distinctive appearance.",
    "Mangrove Cuckoo": "The Mangrove Cuckoo features a unique combination of rufous and white underparts, slightly curved bill, and distinctive white eye ring, enhancing its captivating and tropical appearance.",
    "Yellow Billed Cuckoo": "The Yellow-billed Cuckoo is recognized for its slender body, predominantly brown plumage, and distinctive yellow lower mandible, contributing to its subtle yet easily identifiable appearance.",
    "Gray Crowned Rosy Finch": "The Gray-crowned Rosy Finch displays a gray plumage with a rosy hue on its crown, complemented by a distinctive dark bib, adding to its distinctive and subtly colorful appearance.",
    "Purple Finch": "The Purple Finch is noted for its raspberry-red plumage on males, streaked brown body on females, and distinctive conical bill, creating a visually distinct and sexually dimorphic appearance.",
    "Northern Flicker": "The Northern Flicker features a brown body with black crescent markings on its chest, a distinctive white rump patch, and a red nape on males, contributing to its unique and easily recognizable appearance.",
    "Acadian Flycatcher": "The Acadian Flycatcher displays a plain olive-green upper body, slightly crested head, and distinctive eye ring, contributing to its subtly understated yet identifiable appearance.",
    "Great Crested Flycatcher": "The Great Crested Flycatcher is recognized for its bright lemon-yellow belly, olive-green upperparts, rufous wings and tail, and distinctive crested head, adding to its striking and easily recognizable appearance.",
    "Least Flycatcher": "The Least Flycatcher showcases plain olive-green plumage, a small size, and a distinctive pale eye ring, contributing to its subtly modest yet identifiable appearance.",
    "Olive Sided Flycatcher": "The Olive-sided Flycatcher is known for its plain grayish-brown plumage, distinctive white patches on its sides, and unique habit of perching on exposed branches, contributing to its subtly marked and recognizable appearance.",
    "Scissor Tailed Flycatcher": "The Scissor-tailed Flycatcher is characterized by its long, deeply forked tail, pale gray body, salmon-pink flanks, and distinctive habit of aerial acrobatics, creating a striking and visually captivating appearance.",
    "Vermilion Flycatcher": "The Vermilion Flycatcher stands out with its brilliant red plumage on males, contrasting against brownish wings and tail, and a slender bill, contributing to its vibrant and eye-catching appearance.",
    "Yellow Bellied Flycatcher": "The Yellow-bellied Flycatcher features an olive-green upper body, pale yellow underparts, and a distinctive eyering, creating a subtly marked and identifiable appearance.",
    "Frigatebird": "The Frigatebird is recognized for its large size, dark plumage, distinctive long wings, deeply forked tail, and a bright red throat pouch on males, contributing to its striking and unmistakable appearance.",
    "Northern Fulmar": "The Northern Fulmar displays a medium-sized seabird appearance with a pale gray body, darker wingtips, and a distinctive tube-like nose, contributing to its distinctive and efficient marine presence.",
    "Gadwall": "The Gadwall is noted for its mottled brown body, distinctive white speculum (wing patch), and a subtle grayish-brown head with a distinctive black bill, presenting a subtly patterned and recognizable appearance.",
    "American Goldfinch": "The American Goldfinch boasts bright yellow plumage on males during breeding season, transitioning to a more subdued olive-brown in winter, with distinctive black wings and white wingbars, contributing to its striking and seasonally variable appearance.",
    "European Goldfinch": "The European Goldfinch features a vibrant red face and black and white head markings, complemented by a striking yellow wing patch and black wings with white bars, contributing to its colorful and distinctive appearance.",
    "Boat Tailed Grackle": "The Boat-tailed Grackle is recognized for its glossy black plumage with iridescent blue-green highlights, long keel-shaped tail, and distinctive bright yellow eyes, contributing to its charismatic and easily identifiable appearance.",
    "Eared Grebe": "The Eared Grebe is characterized by its compact size, dark neck and head, and distinctive golden ear feathers behind the eye during breeding season, presenting a subtly detailed and seasonally variable appearance.",
    "Horned Grebe": "The Horned Grebe is noted for its striking red eyes, distinctive golden horns during breeding season, and its dark neck and head contrasting with its white face and body, presenting a unique and easily recognizable appearance.",
    "Pied Billed Grebe": "The Pied-billed Grebe showcases a distinctive black vertical stripe on its bill, dark brown plumage, and a slightly upturned tail, contributing to its subtly marked and characteristic appearance.",
    "Western Grebe": "The Western Grebe stands out with its long, slender neck, striking black crown and nape, distinctive white cheeks, and a unique breeding display involving synchronized swimming, adding to its elegant and recognizable appearance.",
    "Blue Grosbeak": "The Blue Grosbeak features vibrant blue plumage on males, contrasting with warm rusty underparts, a slightly curved bill, and distinctive wingbars, contributing to its colorful and eye-catching appearance.",
    "Evening Grosbeak": "The Evening Grosbeak showcases a striking mix of yellow, black, and white plumage, a massive bill, and distinctive white wing patches, contributing to its bold and visually captivating appearance.",
    "Pine Grosbeak": "The Pine Grosbeak displays a distinctive combination of rosy-red plumage on males, grayish body on females, and a heavy bill, contributing to its unique and visually appealing appearance.",
    "Rose Breasted Grosbeak": "The Rose-breasted Grosbeak is recognized by its vibrant rosy-red breast patch on males, contrasting with black and white plumage, and a distinctive conical bill, contributing to its eye-catching and sexually dimorphic appearance.",
    "Pigeon Guillemot": "The Pigeon Guillemot features black upperparts, white underparts, distinctive red legs and feet, and a bright red inner mouth lining, creating a visually distinctive and charismatic appearance.",
    "California Gull": "The California Gull is noted for its clean white body, gray upperparts, distinctive yellow bill with red spot, and a black ring around the eye, presenting a recognizable and coastal avian appearance.",
    "Glaucous Winged Gull": "The Glaucous-winged Gull showcases a pale gray mantle, white body, distinctive pale eyes, and subtle pink legs, contributing to its coastal and distinctively marked appearance.",
    "Heermann Gull": "The Heermann's Gull stands out with its slate-gray body, contrasting black hood, distinctive red bill, and a preference for coastal habitats, creating a visually distinct and easily recognizable appearance.",
    "Herring Gull": "The Herring Gull is characterized by its pale gray mantle, white body, yellow bill with red spot, and pink legs, contributing to its widely recognized and coastal avian appearance.",
    "Ivory Gull": "The Ivory Gull stands out with its pristine white plumage, black legs, bill, and distinctive black eyes, creating a striking and polar-adapted appearance.",
    "Ring Billed Gull": "The Ring-billed Gull features a pale gray mantle, white body, distinctive yellow bill with a black ring near the tip, and yellow legs, contributing to its easily identifiable and coastal avian appearance.",
    "Slaty Backed Gull": "The Slaty-backed Gull is recognized for its dark gray to black mantle, white head and body, distinctive pale eyes, and robust bill, creating a visually unique and coastal avian appearance.",
    "Western Gull": "The Western Gull showcases a pale gray mantle, white body, distinctive yellow bill with a red spot, and pink legs, presenting a coastal avian appearance that is characteristic and easily recognizable.",
    "Anna Hummingbird": "The Anna Hummingbird features iridescent emerald-green plumage on males, grayish-green on females, and a distinctive rose-red throat patch (gorget) on males, contributing to its vibrant and sexually dimorphic appearance.",
    "Ruby Throated Hummingbird": "The Ruby-throated Hummingbird showcases iridescent green plumage, a distinctive vibrant ruby-red throat (gorget) on males, and a relatively small size, creating a visually captivating and sexually dimorphic appearance.",
    "Rufous Hummingbird": "The Rufous Hummingbird displays vibrant orange-brown plumage on males, contrasting with green on females, and a distinctive rufous (reddish-brown) iridescent throat (gorget) on males, presenting a striking and sexually dimorphic appearance.",
    "Green Violetear": "The Green Violetear is noted for its iridescent green plumage, distinctive violet-blue crown, and characteristic elongated central tail feathers, contributing to its colorful and easily identifiable appearance.",
    "Long Tailed Jaeger": "The Long-tailed Jaeger showcases a slender build, pale grayish-brown plumage, distinctive elongated central tail feathers, and a sharp, pointed bill, creating a distinctive and striking appearance.",
    "Pomarine Jaeger": "The Pomarine Jaeger is recognized for its robust build, dark brown plumage with a distinctive pale neck collar, elongated central tail feathers, and a powerful hooked bill, contributing to its distinctive and predatory appearance.",
    "Blue Jay": "The Blue Jay features vibrant blue upperparts, white underparts, a distinctive crest, and a striking black necklace-like marking across its throat, creating a colorful and easily recognizable appearance.",
    "Florida Jay": "The Florida Jay displays a unique combination of blue upperparts, grayish-white underparts, a distinctive crest, and a bold black facial pattern, contributing to its striking and regionally specific appearance.",
    "Green Jay": "The Green Jay showcases vibrant green plumage on its body, a distinctive black mask extending from the bill to the nape, and blue and yellow highlights on its wings, presenting a colorful and striking appearance.",
    "Dark Eyed Junco": "The Dark-eyed Junco is characterized by its gray or brown upperparts, white underparts, and distinct white outer tail feathers, creating a subtly marked and regionally variable appearance.",
    "Tropical Kingbird": "The Tropical Kingbird features a distinctive lemon-yellow belly, grayish upperparts, bold white throat, and a black crown patch, contributing to its bright and easily recognizable appearance.",
    "Gray Kingbird": "The Gray Kingbird is recognized for its sleek gray plumage, distinctive white underside, and slightly hooked black bill, creating a subtly marked and charismatic appearance.",
    "Belted Kingfisher": "The Belted Kingfisher showcases a distinctive powder-blue upper body, white underparts with a rust-colored belly band on females, and a prominent crested head, contributing to its striking and easily identifiable appearance.",
    "Green Kingfisher": "The Green Kingfisher is noted for its rich green upperparts, white underparts, bold white collar around the neck, and a distinctive white spot in front of the eye, creating a colorful and easily recognizable appearance.",
    "Pied Kingfisher": "The Pied Kingfisher is recognized for its distinctive black and white plumage, spiky crest, large head, and a straight black bill, presenting a bold and unmistakable appearance.",
    "Ringed Kingfisher": "The Ringed Kingfisher features a bold blue and white plumage, distinctive large size, spiky crest, and a robust straight bill, contributing to its striking and easily recognizable appearance.",
    "White Breasted Kingfisher": "The White-breasted Kingfisher showcases a vivid blue upper body, white underparts, distinctive white throat, and a robust black bill, creating a visually striking and easily identifiable appearance.",
    "Red Legged Kittiwake": "The Red-legged Kittiwake is characterized by its black and white plumage, distinctive red legs, and a small size, contributing to its striking and regionally specific appearance",
    "Horned Lark": "The Horned Lark features a subtly patterned brown body with distinctive black markings on its face, a small crest, and a white belly, presenting a subtly marked and recognizable appearance.",
    "Pacific Loon": "The Pacific Loon is recognized for its sleek profile, dark upperparts, distinctive white stripes on its neck, and a slightly upturned bill, contributing to its distinctively marked and aquatic avian appearance.",
    "Mallard": "The Mallard is noted for its distinctive glossy green head on males, mottled brown body on females, white neck ring, and distinctive iridescent blue wing speculum, presenting a sexually dimorphic and easily recognizable appearance.",
    "Western Meadowlark": "The Western Meadowlark showcases a bright yellow breast with a distinctive black V pattern, brown upperparts with streaks, and a long, pointed bill, contributing to its vibrant and easily identifiable appearance.",
    "Hooded Merganser": "The Hooded Merganser is recognized for its striking black and white plumage, distinctive fan-shaped crest, and vibrant golden-yellow eyes, presenting a visually captivating and easily recognizable appearance.",
    "Red Breasted Merganser": "The Red-breasted Merganser features a distinct reddish-brown head and breast on males, gray body, and a shaggy crest, contributing to its sexually dimorphic and strikingly marked appearance.",
    "Mockingbird": "The Mockingbird is noted for its plain grayish-brown plumage, white wing patches that flash in flight, and a long tail, contributing to its subtly marked and easily recognizable appearance.",
    "Nighthawk": "The Nighthawk is recognized for its mottled brown and gray plumage, distinctive white wing patch, and a unique erratic flight pattern, contributing to its subtly marked and distinctive appearance.",
    "Clark Nutcracker": "The Clark Nutcracker is characterized by its gray body, black wings, white face and underparts, and a distinctive black cap, contributing to its striking and easily recognizable appearance.",
    "White Breasted Nuthatch": "The White-breasted Nuthatch showcases distinctive blue-gray upperparts, white face and underparts, and a distinctive black cap and eye stripe, contributing to its easily identifiable and charismatic appearance.",
    "Baltimore Oriole": "The Baltimore Oriole features vibrant orange plumage on males, contrasting with black head and wings, and a distinctive black throat and bib on females, contributing to its sexually dimorphic and colorful appearance.",
    "Hooded Oriole": "The Hooded Oriole is recognized for its vibrant yellow plumage, contrasting black face and bib, and a distinctive long tail, creating a visually striking and easily identifiable appearance.",
    "Orchard Oriole": "The Orchard Oriole showcases vibrant orange plumage on males, contrasting with olive-green on females, and a distinctive pointed bill, contributing to its sexually dimorphic and visually captivating appearance.",
    "Scott Oriole": "The Scott Oriole is noted for its bold black and yellow plumage on males, contrasting with olive-gray on females, and a distinctive black face pattern, presenting a sexually dimorphic and visually captivating appearance.",
    "Ovenbird": "The Ovenbird features a plain brownish upper body with distinctive orange crown stripes, white underparts, and a habit of walking on the ground, contributing to its subtly marked and ground-dwelling appearance.",
    "Brown Pelican": "The Brown Pelican is recognized for its large size, distinctively long bill with a pouch, grayish-brown plumage, and a distinctive habit of plunge-diving for fish, creating a distinctive and coastal avian appearance.",
    "White Pelican": "The White Pelican showcases a large size, white plumage, distinctive black wingtips visible in flight, and a distinctive pouched bill, contributing to its striking and aquatic avian appearance.",
    "Western Wood Pewee": "The Western Wood-Pewee is characterized by its plain grayish-brown plumage, slightly peaked head, and a distinctive pale eye ring, creating a subtly marked and easily identifiable appearance.",
    "Sayornis": "Sayornis is a genus of small to medium-sized birds known as flycatchers, typically characterized by their plain plumage, sleek body, and a distinctive habit of catching insects in flight, contributing to their agile and unassuming appearance.",
    "American Pipit": "The American Pipit showcases a plain brownish body, white underparts with distinctive streaking, and a habit of foraging on the ground, creating a subtly marked and terrestrial avian appearance.",
    "Whip Poor Will": "The Whip-poor-will is recognized for its mottled brown and gray plumage, large mouth, and distinctive whip-poor-will call, contributing to its cryptic and nocturnal appearance.",
    "Horned Puffin": "The Horned Puffin features distinctive bright orange bill and legs, white face with black markings, and a prominent horn extending from behind the eye, contributing to its boldly marked and easily identifiable appearance.",
    "Common Raven": "The Common Raven is characterized by its large size, glossy black plumage, shaggy throat feathers, and a distinctive deep croaking call, creating a bold and unmistakable appearance.",
    "White Necked Raven": "The White-necked Raven showcases glossy black plumage, a distinctive white nape, and a slightly curved bill, contributing to its striking and easily recognizable appearance.",
    "American Redstart": "The American Redstart is noted for its black upperparts, bright orange patches on wings and tail, distinctive white eye crescents, and habit of fanning its tail, creating a visually striking and sexually dimorphic appearance.",
    "Geococcyx": "Geococcyx is a genus of birds known as roadrunners, typically characterized by their mottled brown plumage, long tail, distinctive crest, and ground-dwelling habits, contributing to their unique and desert-adapted appearance.",
    "Loggerhead Shrike": "The Loggerhead Shrike features a distinctive black mask across the eyes, gray body, white underparts, and a habit of impaling prey on thorns, creating a visually distinct and predatory appearance.",
    "Great Grey Shrike": "The Great Grey Shrike is recognized for its gray plumage, white underparts, distinctive black mask, and a habit of impaling prey on thorns, creating a visually distinct and predatory appearance.",
    "Baird Sparrow": "The Baird's Sparrow features subtle brown plumage with streaks on its upperparts, a pale eyebrow stripe, and a distinctive habit of foraging on the ground in grasslands, presenting a subtly marked and terrestrial appearance.",
    "Black Throated Sparrow": "The Black-throated Sparrow showcases a distinctive combination of grayish-brown upperparts, white underparts, and a striking black throat patch on males, creating a subtly marked and desert-adapted appearance.",
    "Brewer Sparrow": "The Brewer's Sparrow features a plain and subtly streaked brownish-gray plumage, a pale eyering, and a habit of foraging on the ground in arid habitats, creating a subtly marked and desert-adapted appearance.",
    "Chipping Sparrow": "The Chipping Sparrow features a rufous crown, grayish face and underparts, and a distinct black line through its eye, contributing to its subtly marked and easily recognizable appearance.",
    "Clay Colored Sparrow": "The Clay-colored Sparrow is recognized for its pale grayish-brown plumage, distinct pale crown stripe, and a habit of singing from open perches in grassy areas, presenting a subtly marked and grassland-dwelling appearance.",
    "House Sparrow": "The House Sparrow is characterized by its dull brown plumage, grayish underparts, and distinctive black bib on males, presenting a common and easily recognizable urban avian appearance.",
    "Field Sparrow": "The Field Sparrow showcases plain and subtly streaked brown plumage, a distinctive pinkish bill, and a habit of singing from low shrubs in grassy fields, creating a subtly marked and grassland-associated appearance.",
    "Fox Sparrow": "The Fox Sparrow features a distinct mix of rufous, gray, and brown plumage with streaks, a boldly marked face pattern, and a habit of scratching the ground for food, contributing to its visually distinct and ground-dwelling appearance.",
    "Grasshopper Sparrow": "The Grasshopper Sparrow is recognized for its subtly streaked brown plumage, distinctive flat head profile, and a habit of singing from low perches in grassy areas, presenting a subtly marked and grassland-dwelling appearance.",
    "Harris Sparrow": "The Harris's Sparrow showcases a boldly marked face pattern with distinctive black crown, gray sides of the head, and a habit of foraging on the ground, contributing to its striking and northern-dwelling appearance.",
    "Henslow Sparrow": "The Henslow's Sparrow features a subtly streaked brownish-gray plumage, a distinctive flat head profile, and a habit of singing from dense grassy cover, contributing to its elusive and grassland-associated appearance.",
    "Le Conte Sparrow": "The LeConte's Sparrow is recognized for its subtle buff and brown streaked plumage, distinctive pale eyering, and a habit of foraging in dense grassy cover, presenting a subtly marked and grassland-associated appearance.",
    "Lincoln Sparrow": "The Lincoln's Sparrow features a subtly streaked brownish-gray plumage, a distinct buffy eyering, and a habit of foraging in dense shrubs and low vegetation, creating a subtly marked and secretive appearance.",
    "Nelson Sharp Tailed Sparrow": "The Nelson's Sharp-tailed Sparrow is characterized by its subtly streaked gray and brown plumage, distinct buffy eyebrow stripe, and a habit of skulking in dense saltmarsh vegetation, presenting a subtly marked and secretive appearance.",
    "Savannah Sparrow": "The Savannah Sparrow showcases subtly streaked brownish-gray plumage, a distinctive yellowish eyebrow stripe, and a habit of foraging in open grassy habitats, creating a subtly marked and adaptable appearance.",
    "Seaside Sparrow": "The Seaside Sparrow is recognized for its subtly streaked brownish-gray plumage, distinctive pale eyering, and a habit of skulking in dense saltmarsh vegetation, presenting a subtly marked and marsh-dwelling appearance.",
    "Song Sparrow": "The Song Sparrow features a subtly streaked brown plumage, a distinct dark central breast spot, and a habit of singing from open perches in a wide range of habitats, creating a subtly marked and versatile appearance.",
    "Tree Sparrow": "The Tree Sparrow showcases a subtly streaked brownish-gray plumage with a distinctive dark central breast spot, and a habit of foraging in shrubs and trees, presenting a subtly marked and woodland-associated appearance.",
    "Vesper Sparrow": "The Vesper Sparrow features a subtly streaked brownish-gray plumage, a distinct white eye ring, and a habit of singing from open ground or low perches in grassy areas, creating a subtly marked and grassland-dwelling appearance.",
    "White Crowned Sparrow": "The White-crowned Sparrow showcases distinctive black-and-white striped crown, grayish body, and a habit of foraging on the ground, contributing to its bold and easily recognizable appearance.",
    "White Throated Sparrow": "The White-throated Sparrow features a grayish-brown body with a distinctive white throat and bold black-and-white head stripes, creating a striking and easily recognizable appearance.",
    "Cape Glossy Starling": "The Cape Glossy Starling is noted for its iridescent blue-green plumage, distinctive orange eye, and glossy appearance, presenting a visually captivating and colorful avian look.",
    "Bank Swallow": "The Bank Swallow features plain brownish-gray upperparts, white underparts, a distinct brown band across its chest, and a habit of nesting in sandy cliffs, creating a subtly marked and burrowing avian appearance.",
    "Barn Swallow": "The Barn Swallow is recognized for its distinctive long tail streamers, glossy blue upperparts, red throat and forehead, and a habit of catching insects in mid-air, creating a visually distinct and agile appearance.",
    "Cliff Swallow": "The Cliff Swallow showcases a plain brownish-gray body with a distinctive buffy forehead, white underparts, and a habit of building mud nests on vertical surfaces, creating a subtly marked and structure-nesting appearance.",
    "Tree Swallow": "The Tree Swallow is recognized for its glossy blue-green upperparts, white underparts, distinctive forked tail, and a habit of catching insects in mid-air, creating a visually striking and agile appearance.",
    "Scarlet Tanager": "The Scarlet Tanager features vibrant red plumage on males, olive-green on females, a distinctive black wings and tail, and a habit of foraging high in trees, creating a striking and sexually dimorphic appearance.",
    "Summer Tanager": "The Summer Tanager showcases vibrant red plumage in males, yellowish plumage in females, and a distinctive habit of foraging for insects in tree canopies, presenting a brightly colored and sexually dimorphic appearance.",
    "Artic Tern": "The Arctic Tern is characterized by its white plumage, deeply forked tail, gray wings, and a habit of long migrations between polar regions, contributing to its distinctive and long-distance flying appearance.",
    "Black Tern": "The Black Tern features a striking black body, gray wings, and a distinctive white patch on its underwings, with a habit of hovering and dipping over water while foraging, creating a visually captivating and aquatic avian appearance.",
    "Caspian Tern": "The Caspian Tern showcases a large size, white plumage, distinctive black cap, and a massive bright red bill, often seen foraging near water bodies, creating a bold and easily recognizable coastal appearance.",
    "Common Tern": "The Common Tern features a white body with gray wings, a distinctive black cap, and a forked tail, often seen diving into water to catch fish, creating a coastal and aerial foraging appearance.",
    "Elegant Tern": "The elegant tern features a slender body, black cap, and long, gracefully curved wings, exhibiting a striking contrast of black and white plumage.",
    "Forsters Tern": "The Forsters tern displays a pale gray back and wings, white underside, forked tail, and distinctive black cap during breeding, highlighting its elegant and contrasted plumage.",
    "Least Tern": "The Least tern showcases a small size, white underside, pale gray wings, and a distinctive black cap during breeding, embodying a compact and striking coastal bird.",
    "Green Tailed Towhee": "The Green-tailed Towhee features a warm brown body, olive-green tail, white belly, and striking red-brown eyes, creating a visually distinctive and colorful bird.",
    "Brown Thrasher": "The Brown Thrasher is recognized by its rich brown plumage, bold streaked chest, long curved bill, and bright yellow eyes, embodying a unique and earth-toned avian appearance.",
    "Sage Thrasher": "The Sage Thrasher displays a subtle blend of gray and brown tones, with a pale underside, streaked throat, and distinctive white eye stripe, reflecting its well-camouflaged and arid habitat.",
    "Black Capped Vireo": "The Black-capped Vireo showcases a grayish body, a black cap on its head, white underparts, and a slightly hooked bill, creating a unique contrast in its appearance.",
    "Blue Headed Vireo": "The Blue-headed Vireo features a bluish-gray head, an olive-green body, a distinct white eyebrow stripe, and a slightly hooked bill, contributing to its distinctive appearance.",
    "Philadelphia Vireo": "The Philadelphia Vireo displays an olive-green body, a distinct yellow crown, a white eye ring, and a slightly hooked bill, adding a touch of color to its appearance.",
    "Red Eyed Vireo": "The Red-eyed Vireo showcases an olive-green body, a distinctive white eyebrow stripe, a red eye, and a slightly hooked bill, creating a recognizable appearance.",
    "Warbling Vireo": "The Warbling Vireo displays a plain olive-green body, a light-colored throat, a slightly hooked bill, and a subtle white stripe over its eye.",
    "White Eyed Vireo": "The White eyed Vireo features a bright yellow-green body, a distinct white eye ring, and a slightly hooked bill, creating a vibrant and distinctive look.",
    "Yellow Throated Vireo": "The Yellow throated Vireo showcases an olive-green body, a bright yellow throat and underparts, a distinct white eye stripe, and a slightly hooked bill, adding a touch of color to its appearance.",
    "Bay Breasted Warbler": "The Bay breasted Warbler displays a distinctive chestnut crown, black face mask, and streaks, often with a slight pinkish hue on its underparts, contributing to its unique appearance.",
    "Black And White Warbler": "The Black and white Warbler displays bold black-and-white stripes on its body, resembling a tiny zebra, with a slightly curved bill, contributing to its distinctive appearance.",
    "Black Throated Blue Warbler": "The Black throated Blue Warbler showcases a deep blue upper body, a white underbelly, and a black throat patch, creating a striking contrast in its appearance.",
    "Blue Winged Warbler": "The Blue-winged Warbler displays a yellow body with a blue-gray patch on its wings, a white underbelly, and a slightly curved bill, contributing to its recognizable appearance.",
    "Canada Warbler": "The Canada Warbler features a slate-blue gray upper body, a bright yellow underbelly, and a distinct necklace of dark streaks, creating a unique and contrasting pattern.",
    "Cape May Warbler": "The Cape May Warbler showcases a yellow body with distinctive rust-colored streaks, a green back, a bold black face mask, and a slightly curved bill, contributing to its striking appearance.",
    "Cerulean Warbler": "The Cerulean Warbler features a sky-blue upper body, a white underbelly, a distinctive black necklace-like streak, and a slightly curved bill, creating a unique and eye-catching look.",
    "Chestnut Sided Warbler": "The Chestnut-sided Warbler has a bright yellow body with white underparts, a distinctive chestnut patch on its sides, and a gray cap, contributing to its recognizable appearance.",
    "Golden Winged Warbler": "The Golden-winged Warbler displays a grayish body, a bright yellow crown, and a bold black eye patch, with striking golden wing bars that set it apart.",
    "Hooded Warbler": "The Hooded Warbler features a black hood-like mask on its head, a bright yellow underbody, and a distinctive olive-green back, creating a unique and contrasting pattern.",
    "Kentucky Warbler": "The Kentucky Warbler showcases a bright yellow underbelly, an olive-green back, a distinctive black face mask, and a slightly curved bill, making it a recognizable woodland species.",
    "Magnolia Warbler": "The Magnolia Warbler displays a striking appearance with a black face mask, a bright yellow throat and underparts, and a distinctive white stripe on its wings, set against an olive-green body.",
    "Mourning Warbler": "The Mourning Warbler features an olive-green body with a distinctive blue-gray hood, a bright yellow throat and underparts, and a slightly curved bill.",
    "Myrtle Warbler": "The Myrtle Warbler showcases an olive-green body, a bright yellow throat and underparts, and a contrasting white eye stripe, often seen in its distinctive black face mask.",
    "Nashville Warbler": "The Nashville Warbler features an olive-green body with a gray head, a distinct white eye ring, and a slightly curved bill, lending it a subdued yet identifiable look.",
    "Orange Crowned Warbler": "The Orange-crowned Warbler has a plain olive-green body, often with a subtle yellowish tinge, and lacks strong markings, making its orange crown patch hard to see.",
    "Palm Warbler": "The Palm Warbler showcases a brownish body with a yellow undertail, a distinct rusty cap, and a slightly curved bill, often seen wagging its tail while foraging.",
    "Pine Warbler": "The Pine Warbler features a plain olive-green body, a slightly yellowish throat and underparts, and a slender, pointed bill, suited to its coniferous forest habitat.",
    "Prairie Warbler": "The Prairie Warbler displays a bright yellow body with bold black streaks on its sides, a distinctive black eye stripe, and a slightly curved bill, making it easily recognizable.",
    "Prothonotary Warbler": "The Prothonotary Warbler showcases a vibrant golden-yellow body, a slightly curved bill, and a prominent blue-gray wing patch, adding a splash of color to its wetland habitat.",
    "Swainson Warbler": "The Swainson Warbler features a plain brown body, a distinctive olive-brown cap, a buff-colored throat, and a slightly curved bill, suited for its secretive ground-dwelling behavior.",
    "Tennessee Warbler": "The Tennessee Warbler has a plain grayish-green body, a white underbelly, a faint eyeline, and a slightly pointed bill, fitting its understated yet elegant appearance.",
    "Wilson Warbler": "The Wilson's Warbler displays a bright yellow body, a distinct black cap, and a slightly curved bill, adding a pop of color to its appearance.",
    "Worm Eating Warbler": "The Worm-eating Warbler features a plain olive-brown upper body, a buff-colored head with bold dark stripes, a white throat, and a slender, pointed bill, adapted for its ground-dwelling foraging habits.",
    "Yellow Warbler": "The Yellow Warbler showcases a bright yellow body, often with reddish streaks on its chest, and a slightly curved bill, bringing a splash of color to its surroundings.",
    "Northern Waterthrush": "The Northern Waterthrush displays a plain olive-brown upper body, white underparts with dark streaks, a prominent white eyeline, and a slightly curved bill, well-suited for its wetland habitat.",
    "Louisiana Waterthrush": "The Louisiana Waterthrush features a buffy-white underbelly, a brownish back with streaks, a prominent white eyeline, and a slightly downward-curving bill adapted for its aquatic habitat.",
    "Bohemian Waxwing": "The Bohemian Waxwing has a grayish-brown body, a distinctive crest on its head, black mask with white and yellow markings, and bright red wingtips on a slightly larger frame than the Cedar Waxwing.",
    "Cedar Waxwing": "The Cedar Waxwing features a sleek, brownish-gray body, a crest on its head, black mask-like markings, and waxy red tips on its secondary feathers.",
    "American Three Toed Woodpecker": "The American Three-toed Woodpecker has black and white plumage, a barred back, a white stripe on the wings, and males display a small yellow patch on their heads.",
    "Pileated Woodpecker": "The Pileated Woodpecker is a large black bird with a prominent red crest, white stripes on its face, and a white throat.",
    "Red Bellied Woodpecker": "The Red bellied Woodpecker has a zebra-like pattern on its back, a red nape and crown, and a faint red tinge on its belly.",
    "Red Cockaded Woodpecker": "The Red cockaded Woodpecker features a black-and-white striped back, with a small white cheek patch and a unique cap of red on males, while females have a black cap.",
    "Red Headed Woodpecker": "The Red headed Woodpecker displays a striking appearance with a deep red head, black body, and wings marked with white patches, creating a bold and contrasting pattern.",
    "Downy Woodpecker": "The Downy Woodpecker features a small black-and-white bird with a white throat, black wings with white spots, a short bill, and a prominent white stripe down its back.",
    "Bewick Wren": "The Bewick's Wren showcases a small brown bird with a white throat, fine dark streaks on its back, a long tail often held upright, and a slender, slightly curved bill.",
    "Cactus Wren": "The Cactus Wren displays a boldly patterned appearance with white and black stripes on its head, a rusty-brown body, and a distinctive long curved bill.",
    "Carolina Wren": "The Carolina Wren features a rufous-brown body, a distinct white eyebrow stripe, a slightly curved bill, and a perky upright tail.",
    "House Wren": "The House Wren showcases a small, brown-speckled body, often holding its tail upright, with a slightly curved bill, and a white eyebrow stripe.",
    "Marsh Wren": "The Marsh Wren displays a small plump body with streaked brown and white plumage, a short tail often cocked, and a distinctive white line above the eye.",
    "Rock Wren": "The Rock Wren features a compact body, brown and gray mottled plumage, prominent white eyelines, and a slightly curved bill, adapted for its rocky habitat.",
    "Winter Wren": "The Winter Wren is a tiny bird with a mottled brown body, a short tail often held upright, and a slightly curved bill.",
    "Common Yellowthroat": "The Common Yellowthroat is a small songbird with a distinctive olive-green body, yellow throat, and a black mask-like pattern across its face."
}